MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK52DN512CLQ10/mcu.h
/*! @name C0 - Control Register 0 */
#define OPAMP_C0_MODE_MASK                       (0x3U)
#define OPAMP_C0_MODE_SHIFT                      (0U)
#define OPAMP_C0_MODE(x)                         (((uint8_t)(((uint8_t)(x)) << OPAMP_C0_MODE_SHIFT)) & OPAMP_C0_MODE_MASK)
#define OPAMP_C0_LPEN_MASK                       (0x40U)
#define OPAMP_C0_LPEN_SHIFT                      (6U)
#define OPAMP_C0_LPEN(x)                         (((uint8_t)(((uint8_t)(x)) << OPAMP_C0_LPEN_SHIFT)) & OPAMP_C0_LPEN_MASK)
#define OPAMP_C0_EN_MASK                         (0x80U)
#define OPAMP_C0_EN_SHIFT                        (7U)
#define OPAMP_C0_EN(x)                           (((uint8_t)(((uint8_t)(x)) << OPAMP_C0_EN_SHIFT)) & OPAMP_C0_EN_MASK)

/*! @name C1 - Control Register 1 */
#define OPAMP_C1_AMPRI_MASK                      (0x3U)
#define OPAMP_C1_AMPRI_SHIFT                     (0U)
#define OPAMP_C1_AMPRI(x)                        (((uint8_t)(((uint8_t)(x)) << OPAMP_C1_AMPRI_SHIFT)) & OPAMP_C1_AMPRI_MASK)
#define OPAMP_C1_AMPRF_MASK                      (0x1CU)
#define OPAMP_C1_AMPRF_SHIFT                     (2U)
#define OPAMP_C1_AMPRF(x)                        (((uint8_t)(((uint8_t)(x)) << OPAMP_C1_AMPRF_SHIFT)) & OPAMP_C1_AMPRF_MASK)

/*! @name C2 - Control Register 2 */
#define OPAMP_C2_AMPNSEL_MASK                    (0x7U)
#define OPAMP_C2_AMPNSEL_SHIFT                   (0U)
#define OPAMP_C2_AMPNSEL(x)                      (((uint8_t)(((uint8_t)(x)) << OPAMP_C2_AMPNSEL_SHIFT)) & OPAMP_C2_AMPNSEL_MASK)
#define OPAMP_C2_AMPPSEL_MASK                    (0x70U)
#define OPAMP_C2_AMPPSEL_SHIFT                   (4U)
#define OPAMP_C2_AMPPSEL(x)                      (((uint8_t)(((uint8_t)(x)) << OPAMP_C2_AMPPSEL_SHIFT)) & OPAMP_C2_AMPPSEL_MASK)


/*!
 * @}
 */ /* end of group OPAMP_Register_Masks */


/* OPAMP - Peripheral instance base addresses */
/** Peripheral OPAMP0 base address */
#define OPAMP0_BASE                              (0x400F5000u)
/** Peripheral OPAMP0 base pointer */
#define OPAMP0                                   ((OPAMP_Type *)OPAMP0_BASE)
/** Peripheral OPAMP1 base address */
#define OPAMP1_BASE                              (0x400F5800u)
/** Peripheral OPAMP1 base pointer */
#define OPAMP1                                   ((OPAMP_Type *)OPAMP1_BASE)
/** Array initializer of OPAMP peripheral base addresses */
#define OPAMP_BASE_ADDRS                         { OPAMP0_BASE, OPAMP1_BASE }
/** Array initializer of OPAMP peripheral base pointers */
#define OPAMP_BASE_PTRS                          { OPAMP0, OPAMP1 }

/*!
 * @}
 */ /* end of group OPAMP_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- OSC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC_Peripheral_Access_Layer OSC Peripheral Access Layer
 * @{
 */

/** OSC - Register Layout Typedef */
typedef struct {
  __IO uint8_t CR;                                 /**< OSC Control Register, offset: 0x0 */
} OSC_Type;

/* ----------------------------------------------------------------------------
   -- OSC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC_Register_Masks OSC Register Masks
 * @{
 */

/*! @name CR - OSC Control Register */
#define OSC_CR_SC16P_MASK                        (0x1U)
#define OSC_CR_SC16P_SHIFT                       (0U)
#define OSC_CR_SC16P(x)                          (((uint8_t)(((uint8_t)(x)) << OSC_CR_SC16P_SHIFT)) & OSC_CR_SC16P_MASK)
#define OSC_CR_SC8P_MASK                         (0x2U)
#define OSC_CR_SC8P_SHIFT                        (1U)
#define OSC_CR_SC8P(x)                           (((uint8_t)(((uint8_t)(x)) << OSC_CR_SC8P_SHIFT)) & OSC_CR_SC8P_MASK)
#define OSC_CR_SC4P_MASK                         (0x4U)
#define OSC_CR_SC4P_SHIFT                        (2U)
#define OSC_CR_SC4P(x)                           (((uint8_t)(((uint8_t)(x)) << OSC_CR_SC4P_SHIFT)) & OSC_CR_SC4P_MASK)
#define OSC_CR_SC2P_MASK                         (0x8U)
#define OSC_CR_SC2P_SHIFT                        (3U)
#define OSC_CR_SC2P(x)                           (((uint8_t)(((uint8_t)(x)) << OSC_CR_SC2P_SHIFT)) & OSC_CR_SC2P_MASK)
#define OSC_CR_EREFSTEN_MASK                     (0x20U)
#define OSC_CR_EREFSTEN_SHIFT                    (5U)
#define OSC_CR_EREFSTEN(x)                       (((uint8_t)(((uint8_t)(x)) << OSC_CR_EREFSTEN_SHIFT)) & OSC_CR_EREFSTEN_MASK)
#define OSC_CR_ERCLKEN_MASK                      (0x80U)
#define OSC_CR_ERCLKEN_SHIFT                     (7U)
#define OSC_CR_ERCLKEN(x)                        (((uint8_t)(((uint8_t)(x)) << OSC_CR_ERCLKEN_SHIFT)) & OSC_CR_ERCLKEN_MASK)


/*!
 * @}
 */ /* end of group OSC_Register_Masks */


/* OSC - Peripheral instance base addresses */
/** Peripheral OSC base address */
#define OSC_BASE                                 (0x40065000u)
/** Peripheral OSC base pointer */
#define OSC                                      ((OSC_Type *)OSC_BASE)
/** Array initializer of OSC peripheral base addresses */
#define OSC_BASE_ADDRS                           { OSC_BASE }
/** Array initializer of OSC peripheral base pointers */
#define OSC_BASE_PTRS                            { OSC }

/*!
 * @}
 */ /* end of group OSC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PDB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PDB_Peripheral_Access_Layer PDB Peripheral Access Layer
 * @{
 */

/** PDB - Register Layout Typedef */
typedef struct {
  __IO uint32_t SC;                                /**< Status and Control Register, offset: 0x0 */
  __IO uint32_t MOD;                               /**< Modulus Register, offset: 0x4 */
  __I  uint32_t CNT;                               /**< Counter Register, offset: 0x8 */
  __IO uint32_t IDLY;                              /**< Interrupt Delay Register, offset: 0xC */
  struct {                                         /* offset: 0x10, array step: 0x28 */
    __IO uint32_t C1;                                /**< Channel n Control Register 1, array offset: 0x10, array step: 0x28 */
    __IO uint32_t S;                                 /**< Channel n Status Register, array offset: 0x14, array step: 0x28 */
    __IO uint32_t DLY[2];                            /**< Channel n Delay 0 Register..Channel n Delay 1 Register, array offset: 0x18, array step: index*0x28, index2*0x4 */
         uint8_t RESERVED_0[24];
  } CH[2];
       uint8_t RESERVED_0[240];
  struct {                                         /* offset: 0x150, array step: 0x8 */
    __IO uint32_t INTC;                              /**< DAC Interval Trigger n Control Register, array offset: 0x150, array step: 0x8 */
    __IO uint32_t INT;                               /**< DAC Interval n Register, array offset: 0x154, array step: 0x8 */
  } DAC[2];
       uint8_t RESERVED_1[48];
  __IO uint32_t POEN;                              /**< Pulse-Out n Enable Register, offset: 0x190 */
  __IO uint32_t PODLY[3];                          /**< Pulse-Out n Delay Register, array offset: 0x194, array step: 0x4 */
} PDB_Type;

/* ----------------------------------------------------------------------------
   -- PDB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PDB_Register_Masks PDB Register Masks
 * @{
 */

